
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура РасшКалькПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	СписокОбъектов.Добавить(Документы.НачислениеДивидендов);

	УчетОбособленныхПодразделений.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	
	ЗарплатаКадры.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	
	РегламентированнаяОтчетность.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	
	ЭлектронноеВзаимодействие.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
КонецПроцедуры
