
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Отчет комитенту
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОтчетКомитентуОПродажах";
	КомандаПечати.Представление = НСтр("ru = 'Отчет комитенту'");

	// Акт об оказании услуг
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");

	// Счет-фактура
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура'");
	КомандаПечати.Обработчик    = "УчетНДСКлиент.ВыполнитьКомандуПечатиСчетовФактур";
	
	// Справка-расчет "Рублевые суммы документа в валюте"
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьРублевыхСуммДокументовВВалюте";
	КомандаПечати.Идентификатор = "РублевыеСуммыДокументаВВалюте";
	КомандаПечати.Представление = НСтр("ru = 'Справка-расчет ""Рублевые суммы документа в валюте""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ФункциональныеОпции = "ИспользоватьВалютныйУчет";
	
	// Универсальный передаточный документ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "УниверсальныйПередаточныйДокумент";
	КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ (УПД)'");
	КомандаПечати.Обработчик    = "УчетНДСКлиент.ВыполнитьКомандуПечатиУниверсальныхПередаточныхДокументов";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Отчет комитенту""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("ВременнаяТаблицаКлючиСтрок",	        НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаПоступление",	    НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаГТД",    			НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаПоставщики",	        НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаНаличиеТоваров",     НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты",     				        НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаКомиссионногоВознаграждения", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте",  НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_НаименованиеУслугПредварительная",НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_НаименованиеУслуг",  				НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", 	        НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧПоставщики.Поставщик КАК Поставщик,
	|	ТЧПоставщики.КлючСтроки КАК КлючСтроки,
	|	ТЧПоставщики.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ТЧПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Грузоотправитель,
	|	ЕСТЬNULL(ТЧПоставщики.Партия.Грузополучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Грузополучатель
	|ПОМЕСТИТЬ ВТ_КлючиСтрок
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|ГДЕ
	|	ТЧПоставщики.Ссылка = &ДокументОснование
	|	И ТЧПоставщики.СчетФактура = &СчетФактура
	|	И ТЧПоставщики.СчетФактура <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)
	|	И ТЧПоставщики.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПоставщики.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки КАК КлючСтроки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ПоступлениеТоваровУслугТовары.НомерСтроки) КАК НомерСтроки,
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК ПТиУ,
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_НомерСтроки_ГТД
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|			ПО ПоступлениеТоваровУслугТовары.НомерГТД = НомераГТД.Ссылка
	|		ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПоступлениеТоваровУслугТовары.Ссылка
	|ГДЕ
	|	НЕ НомераГТД.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НомерСтроки_ГТД.КлючСтроки КАК КлючСтроки,
	|	ВТ_НомерСтроки_ГТД.Ссылка КАК Ссылка,
	|	ВТ_НомерСтроки_ГТД.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.НомерГТД КАК НомерГТД,
	|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ГТД
	|ИЗ
	|	ВТ_НомерСтроки_ГТД КАК ВТ_НомерСтроки_ГТД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_НомерСтроки_ГТД.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ВТ_НомерСтроки_ГТД.НомерСтроки = ПоступлениеТоваровУслугТовары.НомерСтроки
	|			И ВТ_НомерСтроки_ГТД.ПТиУ = ПоступлениеТоваровУслугТовары.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТЧПоставщики.Поставщик) КАК Продавец,
	|	МАКСИМУМ(ТЧПоставщики.Грузоотправитель) КАК Грузоотправитель,
	|	МАКСИМУМ(ТЧПоставщики.Грузополучатель) КАК Грузополучатель,
	|	ТЧПоставщики.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Поставщики
	|ИЗ
	|	ВТ_КлючиСтрок КАК ТЧПоставщики
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧПоставщики.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ИЛИ ТаблицаТовары.Номенклатура.Услуга
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ЕстьТовары
	|ПОМЕСТИТЬ НаличиеТоваров
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСтрок КАК ВТ_КлючиСтрок
	|		ПО ТаблицаТовары.Ссылка = ВТ_КлючиСтрок.Ссылка
	|			И ТаблицаТовары.КлючСтроки = ВТ_КлючиСтрок.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	Реквизиты.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|					ИНАЧЕ Реквизиты.Организация
	|				КОНЕЦ
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &ПредставлениеПоставщика
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ВТ_Поставщики.Продавец.ОбособленноеПодразделение
	|				И ВТ_Поставщики.Продавец.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ВТ_Поставщики.Продавец.ГоловнойКонтрагент
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Продавец
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|				ИНАЧЕ Реквизиты.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|					ИНАЧЕ Реквизиты.Организация.ИНН
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Продавец.ИНН
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|				ИНАЧЕ Реквизиты.Организация.ИНН
	|			КОНЕЦ
	|	КОНЕЦ КАК ИННпоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.ПодразделениеОрганизации
	|					ИНАЧЕ Реквизиты.Организация
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Поставщики.Грузоотправитель.ОбособленноеПодразделение
	|							И ВТ_Поставщики.Грузоотправитель.ГоловнойКонтрагент = ВТ_Поставщики.Продавец
	|							И ВТ_Поставщики.Грузоотправитель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|						ТОГДА ВТ_Поставщики.Грузоотправитель
	|					ИНАЧЕ ВТ_Поставщики.Продавец
	|				КОНЕЦ
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ""он же""
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &Грузоотправитель
	|		КОГДА ВТ_Поставщики.Грузоотправитель = ВТ_Поставщики.Продавец
	|			ТОГДА ""он же""
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Грузоотправитель
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ВТ_Поставщики.Продавец.ОбособленноеПодразделение
	|			ТОГДА ВТ_Поставщики.Продавец
	|		КОГДА НЕ ВТ_Поставщики.Грузоотправитель ЕСТЬ NULL
	|			ТОГДА ""он же""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Грузополучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Грузополучатель
	|		КОГДА НЕ ВТ_Поставщики.Грузополучатель ЕСТЬ NULL
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	НЕОПРЕДЕЛЕНО КАК Исполнитель,
	|	НЕОПРЕДЕЛЕНО КАК ИсполнительНаОсновании,
	|	НЕОПРЕДЕЛЕНО КАК ОтпускПроизвел,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЧерезКого,
	|	НЕОПРЕДЕЛЕНО КАК ЗаЗаказчикаНаОсновании,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|			ТОГДА ВЫБОР
	|					КОГДА НаличиеТоваров.ЕстьТовары > 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьТовары,
	|	"""" КАК АдресДоставки,
	|	"""" КАК СведенияОТранспортировкеИГрузе,
	|	НЕОПРЕДЕЛЕНО КАК ОтветственныйЗаОформление,
	|	"""" КАК СопроводительныеДокументы,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЛОЖЬ КАК ПеревозкаАвтотранспортом,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &АдресПоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПоставщика,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &ИННКПППоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННКПППоставщика,
	|	&СводныйСФКомиссияПоЗакупке КАК СводныйСФКомиссияПоЗакупке
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поставщики КАК ВТ_Поставщики
	|		ПО Реквизиты.Ссылка = ВТ_Поставщики.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеТоваров КАК НаличиеТоваров
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	1 КАК НомерСтроки,
	|	Реквизиты.УслугаПоВознаграждению КАК Товар,
	|	Реквизиты.УслугаПоВознаграждению.Код КАК ТоварКод,
	|	Реквизиты.УслугаПоВознаграждению.КодОКВЭД2 КАК ТоварАртикул,
	|	ЕСТЬNULL(СправочникНоменклатура.НаименованиеПолное, &ТекстКомиссионноеВознаграждение) КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	"""" КАК РегистрационныйНомерТД,
	|	"""" КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	СУММА(ЕСТЬNULL(ТаблицаТовары.СуммаВознаграждения, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ТаблицаТовары.СуммаНДСВознаграждения, 0)) КАК СуммаНДС,
	|	Реквизиты.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	ЕСТЬNULL(СправочникНоменклатура.ПериодичностьУслуги, НЕОПРЕДЕЛЕНО) КАК ПериодичностьУслуги
	|ПОМЕСТИТЬ ВТВознаграждение
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ТаблицаТовары
	|		ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поставщики КАК ВТ_Поставщики
	|		ПО Реквизиты.Ссылка = ВТ_Поставщики.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Реквизиты.УслугаПоВознаграждению = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И ВТ_Поставщики.Продавец ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.УслугаПоВознаграждению,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.Ссылка,
	|	Реквизиты.СтавкаНДСВознаграждения,
	|	Реквизиты.ВалютаДокумента,
	|	ЕСТЬNULL(СправочникНоменклатура.НаименованиеПолное, &ТекстКомиссионноеВознаграждение),
	|	Реквизиты.УслугаПоВознаграждению.Код,
	|	Реквизиты.УслугаПоВознаграждению.Артикул,
	|	ЕСТЬNULL(СправочникНоменклатура.ПериодичностьУслуги, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего КАК Всего,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС КАК НДС,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ГДЕ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтрокиДокумента,
	|	ТабличнаяЧастьДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки КАК КлючСтроки,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание
	|ПОМЕСТИТЬ ВТ_НаименованиеУслугПредварительная
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПоступлениеТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &ДокументОснование
	|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки,
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Содержание
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	|		ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &ДокументОснование
	|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НаименованиеУслугПредварительная.КлючСтроки КАК КлючСтроки,
	|	ВТ_НаименованиеУслугПредварительная.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТ_НаименованиеУслугПредварительная.Содержание) КАК Содержание
	|ПОМЕСТИТЬ ВТ_НаименованиеУслуг
	|ИЗ
	|	ВТ_НаименованиеУслугПредварительная КАК ВТ_НаименованиеУслугПредварительная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НаименованиеУслугПредварительная.Номенклатура,
	|	ВТ_НаименованиеУслугПредварительная.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	1 КАК НомерСтроки,
	|	ВТВознаграждение.Товар КАК Товар,
	|	ВТВознаграждение.ТоварКод КАК ТоварКод,
	|	ВТВознаграждение.ТоварАртикул КАК ТоварАртикул,
	|	ВТВознаграждение.ТоварНаименование КАК ТоварНаименование,
	|	ВТВознаграждение.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТВознаграждение.ПредставлениеСтраны КАК ПредставлениеСтраны,
	|	ВТВознаграждение.НомерГТД КАК НомерГТД,
	|	ВТВознаграждение.ПредставлениеГТД КАК ПредставлениеГТД,
	|	ВТВознаграждение.РегистрационныйНомерТД КАК РегистрационныйНомерТД,
	|	ВТВознаграждение.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТВознаграждение.Количество КАК Количество,
	|	ВТВознаграждение.Цена КАК Цена,
	|	ВТВознаграждение.Сумма КАК Сумма,
	|	ВТВознаграждение.СуммаНДС КАК СуммаНДС,
	|	ВТВознаграждение.СтавкаНДС КАК СтавкаНДС,
	|	ВТВознаграждение.ЭтоУслуга КАК ЭтоУслуга,
	|	ВТВознаграждение.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТВознаграждение.Ссылка КАК Ссылка,
	|	ВТВознаграждение.ЭтоКомиссия КАК ЭтоКомиссия,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
	|	ВТВознаграждение.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК ТоварКодТНВЭД
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ВТВознаграждение КАК ВТВознаграждение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ПустаяСсылка))
	|			И (ВТВознаграждение.ВалютаДокумента <> &ВалютаРеглУчета)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Номенклатура.Код,
	|	ТаблицаТовары.Номенклатура.Артикул,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Содержание, """") <> """"
	|			ТОГДА ТаблицаТовары.Содержание
	|		КОГДА ЕСТЬNULL(ВТ_НаименованиеУслуг.Содержание, """") = """"
	|			ТОГДА ТаблицаТовары.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ВТ_НаименованиеУслуг.Содержание
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_ГТД.СтранаПроисхождения, ТаблицаТовары.Номенклатура.СтранаПроисхождения),
	|	ЕСТЬNULL(ВТ_ГТД.СтранаПроисхождения.НаименованиеПолное, ТаблицаТовары.Номенклатура.СтранаПроисхождения.НаименованиеПолное),
	|	ЕСТЬNULL(ВТ_ГТД.НомерГТД, ТаблицаТовары.Номенклатура.НомерГТД),
	|	ЕСТЬNULL(ВТ_ГТД.НомерГТД.Представление, ТаблицаТовары.Номенклатура.НомерГТД.Представление),
	|	ЕСТЬNULL(ВТ_ГТД.НомерГТД.РегистрационныйНомер, ТаблицаТовары.Номенклатура.НомерГТД.РегистрационныйНомер),
	|	ТаблицаТовары.ЕдиницаИзмерения,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС,
	|	ЕСТЬNULL(ТаблицаТовары.Номенклатура.Услуга, ЛОЖЬ),
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.Ссылка,
	|	ИСТИНА,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВТ_КлючиСтрок.Поставщик
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСтрок КАК ВТ_КлючиСтрок
	|		ПО ТаблицаТовары.Ссылка = ВТ_КлючиСтрок.Ссылка
	|			И ТаблицаТовары.КлючСтроки = ВТ_КлючиСтрок.КлючСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ПО (ВТ_КлючиСтрок.Ссылка = Реквизиты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО ТаблицаТовары.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГТД КАК ВТ_ГТД
	|		ПО ТаблицаТовары.КлючСтроки = ВТ_ГТД.КлючСтроки
	|			И ТаблицаТовары.Ссылка = ВТ_ГТД.Ссылка
	|			И ТаблицаТовары.Номенклатура = ВТ_ГТД.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованиеУслуг КАК ВТ_НаименованиеУслуг
	|		ПО ТаблицаТовары.КлючСтроки = ВТ_НаименованиеУслуг.КлючСтроки
	|			И ТаблицаТовары.Номенклатура = ВТ_НаименованиеУслуг.Номенклатура
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаДанныеДляПечатиКорректировочныхСчетовФактур(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("Реквизиты",						НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента",		НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	&ПустоеПодразделение КАК Подразделение,
	|	"""" КАК ЦифровойИндексОбособленногоПодразделения,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация.ИНН КАК ИННпоставщика,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПоставщика,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Реквизиты.Организация КАК Покупатель,
	|	Реквизиты.Организация.ИНН КАК ИННпокупателя,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаВзаиморасчетов,
	|	ЛОЖЬ КАК РасчетыВУсловныхЕдиницах,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	НЕОПРЕДЕЛЕНО КАК ОтветственныйЗаОформление,
	|	"""" КАК СопроводительныеДокументы
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	1 КАК НомерСтроки,
	|	"""" КАК Товар,
	|	"""" КАК ТоварКод,
	|	"""" КАК ТоварАртикул,
	|	"""" КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	"""" КАК ЕдиницаИзмерения,
	|	0 КАК КоличествоДоИзменения,
	|	0 КАК КоличествоПослеИзменения,
	|	0 КАК ЦенаДоИзменения,
	|	0 КАК ЦенаПослеИзменения,
	|	0 КАК СтоимостьБезНДСДоИзменения,
	|	0 КАК СтоимостьБезНДСПослеИзменения,
	|	0 КАК СуммаНДСПослеИзменения,
	|	0 КАК СуммаНДСДоИзменения,
	|	0 КАК СтоимостьСНДСДоИзменения,
	|	0 КАК СтоимостьСНДСПослеИзменения,
	|	0 КАК РазницаБезНДСУменьшение,
	|	0 КАК РазницаБезНДСУвеличение,
	|	0 КАК РазницаНДСУменьшение,
	|	0 КАК РазницаНДСУвеличение,
	|	0 КАК РазницаСНДСУменьшение,
	|	0 КАК РазницаСНДСУвеличение,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСДоИзменения,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСПослеИзменения,
	|	ИСТИНА КАК ЭтоУслуга,
	|	Таблица.Ссылка КАК Ссылка,
	|	"""" КАК АдресПоставщика,
	|	"""" КАК ИННКПППоставщика,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК ТоварКодТНВЭД,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК ТоварКодТНВЭДДоИзменения
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Таблица
	|ГДЕ
	|	ЛОЖЬ";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

Функция ТекстЗапросаСчетФактураПолученныйНаАвансРасшифровкаПлатежа(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("ВТ_РасшифровкаПлатежа", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Ссылка КАК ДокументОснование,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам КАК СчетАвансов,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	0 КАК Сумма,
	|	0 КАК СуммаНДС
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаПечатьУниверсальныхПередаточныхДокументов(ИспользуетсяПостановлениеНДС981 = Истина) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка) КАК СчетФактура,
	|	ОтчетКомитентуОПродажах.Дата КАК Дата,
	|	ОтчетКомитентуОПродажах.Номер КАК Номер,
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК Руководитель,
	|	НЕОПРЕДЕЛЕНО КАК ГлавныйБухгалтер,
	|	ИСТИНА КАК СчетФактураБезНДС,
	|	ЛОЖЬ КАК Исправление,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправления,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправления,
	|	ИСТИНА КАК УдалитьПрефиксыИзНомера,
	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	ОтчетКомитентуОПродажах.Ссылка КАК ДокументОснование,
	|	1 КАК НомерСтроки,
	|	ОтчетКомитентуОПродажах.Контрагент,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента,
	|	"""" КАК ИдентификаторГосКонтракта,
	|	"""" КАК КППСчетаФактуры,
	|	"""" КАК КПППродавца,
	|	ОтчетКомитентуОПродажах.Дата КАК ДатаСведений
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате";
	
	Если ИспользуетсяПостановлениеНДС981 Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"ОтчетКомитентуОПродажах.Дата >= ДАТАВРЕМЯ(2017,10,1)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"ОтчетКомитентуОПродажах.Дата < ДАТАВРЕМЯ(2017,10,1)");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетКомитентуОПродажах") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОтчетКомитентуОПродажах", "Отчет комитенту",
			ПечатьОтчетаКомитенту(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОбОказанииУслуг") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктОбОказанииУслуг", "Акт об оказании услуг",
			ПечатьАкта(МассивОбъектов, ОбъектыПечати), , "Документ.ОтчетКомитентуОПродажах.ПФ_MXL_АктОбУслугах");
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	

КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОтчетаКомитенту(МассивОбъектов, ОбъектыПечати)

УстановитьПривилегированныйРежим(Истина);

ТабличныйДокумент = Новый ТабличныйДокумент;
ТабличныйДокумент.АвтоМасштаб			= Истина;
ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитентуОПродажах_ОтчетКомитентуОПродажах";

ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
	ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
КонецЕсли;
ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;

Запрос = Новый Запрос();
Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДополнительнаяКолонкаПечатныхФормДокументов);

Запрос.Текст =
"ВЫБРАТЬ
|	ТЧПоставщики.Ссылка КАК Ссылка,
|	ТЧПоставщики.НомерСтроки КАК НомерСтроки,
|	ТЧПоставщики.КлючСтроки КАК КлючСтроки,
|	ТЧПоставщики.Поставщик КАК Поставщик,
|	ТЧПоставщики.Партия КАК Партия,
|	ДокПоступления.Дата КАК ДатаПартии,
|	ВЫБОР
|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
|			ТОГДА СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента
|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
|	КОНЕЦ КАК ДатаВходящегоСчетаФактуры,
|	ВЫБОР
|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
|			ТОГДА СчетФактураПолученный.Ссылка.НомерВходящегоДокумента
|		ИНАЧЕ """"
|	КОНЕЦ КАК НомерВходящегоСчетаФактуры,
|	ЕСТЬNULL(ДокПоступления.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВходящегоДокумента,
|	ЕСТЬNULL(ДокПоступления.НомерВходящегоДокумента, """") КАК НомерВходящегоДокумента,
|	ТЧПоставщики.СчетФактура КАК СчетФактураВыданный,
|	ВЫБОР
|		КОГДА ТЧПоставщики.ПолученСФ
|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Дата, ТЧПоставщики.ДатаСФ)
|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
|	КОНЕЦ КАК ДатаВыданногоСчетаФактуры,
|	ВЫБОР
|		КОГДА ТЧПоставщики.ПолученСФ
|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Номер, """")
|		ИНАЧЕ """"
|	КОНЕЦ КАК НомерВыданногоСчетаФактуры
|ПОМЕСТИТЬ ВТ_РеквизитыПартий
|ИЗ
|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ДокПоступления
|		ПО ТЧПоставщики.Партия = ДокПоступления.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
|		ПО (ДокПоступления.Ссылка = СчетФактураПолученный.ДокументОснование)
|ГДЕ
|	ТЧПоставщики.Ссылка В(&МассивОбъектов)
|	И ТЧПоставщики.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
|
|ИНДЕКСИРОВАТЬ ПО
|	ТЧПоставщики.Ссылка,
|	ТЧПоставщики.КлючСтроки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов КАК ДокументРасчетов,
|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата КАК Дата,
|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК Номер
|ПОМЕСТИТЬ ТаблицаСчетовФактур
|ИЗ
|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
|		ПО ОтчетКомитентуОПродажахТовары.ДокументРасчетов = СчетФактураВыданныйДокументыОснования.ДокументОснование
|ГДЕ
|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления
|
|СГРУППИРОВАТЬ ПО
|	СчетФактураВыданныйДокументыОснования.Ссылка,
|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата,
|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	СчетФактураВыданный.Ссылка,
|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
|	СчетФактураВыданный.Дата,
|	СчетФактураВыданный.Номер
|ИЗ
|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
|		ПО ОтчетКомитентуОПродажахТовары.ДокументРасчетов = СчетФактураВыданный.Ссылка
|ГДЕ
|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
|	И НЕ СчетФактураВыданный.ПометкаУдаления
|
|СГРУППИРОВАТЬ ПО
|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
|	СчетФактураВыданный.Ссылка,
|	СчетФактураВыданный.Дата,
|	СчетФактураВыданный.Номер
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
|	ОтчетКомитентуОПродажах.Ссылка.ВидОперации КАК ВидОперации,
|	ОтчетКомитентуОПродажах.Ссылка.Номер КАК Номер,
|	ОтчетКомитентуОПродажах.Ссылка.Дата КАК Дата,
|	ОтчетКомитентуОПродажах.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
|	ОтчетКомитентуОПродажах.Ссылка.Контрагент КАК Контрагент,
|	ОтчетКомитентуОПродажах.Ссылка.Организация КАК Организация,
|	ОтчетКомитентуОПродажах.Ссылка.СуммаДокумента КАК СуммаДокумента,
|	ОтчетКомитентуОПродажах.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
|	ОтчетКомитентуОПродажах.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
|	ОтчетКомитентуОПродажах.Ссылка.СуммаВознаграждения КАК СуммаВознаграждения,
|	ОтчетКомитентуОПродажах.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
|	ОтчетКомитентуОПродажах.НомерСтроки КАК НомерСтроки,
|	0 КАК НомерСтрокиПоставщики,
|	ОтчетКомитентуОПродажах.Номенклатура КАК Товар,
|	ВЫБОР
|		КОГДА НЕ ОтчетКомитентуОПродажах.Содержание ПОДОБНО """"
|			ТОГДА ОтчетКомитентуОПродажах.Содержание
|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
|			ТОГДА СправочникНоменклатура.Наименование
|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
|	КОНЕЦ КАК ТоварНаименование,
|	ВЫБОР
|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
|			ТОГДА ОтчетКомитентуОПродажах.Номенклатура.Артикул
|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
|			ТОГДА ОтчетКомитентуОПродажах.Номенклатура.Код
|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
|			ТОГДА """"
|	КОНЕЦ КАК КодАртикул,
|	ОтчетКомитентуОПродажах.КоличествоМест КАК КоличествоМест,
|	ОтчетКомитентуОПродажах.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
|	ОтчетКомитентуОПродажах.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
|	ОтчетКомитентуОПродажах.Количество КАК Количество,
|	ОтчетКомитентуОПродажах.Цена КАК Цена,
|	ОтчетКомитентуОПродажах.Сумма КАК Сумма,
|	ОтчетКомитентуОПродажах.СуммаНДС КАК СуммаНДС,
|	ОтчетКомитентуОПродажах.Покупатель КАК ПокупательПоставщик,
|	ОтчетКомитентуОПродажах.ДатаРеализации КАК ДатаПродажи,
|	ОтчетКомитентуОПродажах.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
|	НЕОПРЕДЕЛЕНО КАК Партия,
|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПартии,
|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоСчетаФактуры,
|	"""" КАК НомерВходящегоСчетаФактуры,
|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
|	"""" КАК НомерВходящегоДокумента,
|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыданногоСчетаФактуры,
|	"""" КАК НомерВыданногоСчетаФактуры,
|	ОтчетКомитентуОПродажах.Покупатель КАК ПолеДляИтогов,
|	СправочникНоменклатура.ПериодичностьУслуги КАК ПериодичностьУслуги,
|	ОтчетКомитентуОПродажах.ДокументРасчетов КАК ДокументРасчетов,
|	ТаблицаСчетовФактур.Ссылка КАК СчетФактураПокупателю,
|	ВЫБОР
|		КОГДА ОтчетКомитентуОПродажах.Количество > 0
|				И НЕ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
|			ТОГДА ""Реализация товаров и услуг""
|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
|				И НЕ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
|			ТОГДА ""Возврат товаров""
|		ИНАЧЕ ""Прочее""
|	КОНЕЦ КАК ВидСобытия,
|	ТаблицаСчетовФактур.Номер КАК НомерСФКомиссионера,
|	ТаблицаСчетовФактур.Дата КАК ДатаСФКомиссионера,
|	ВЫБОР
|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
|				ИЛИ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК ЭтоВозврат
|ИЗ
|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажах
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
|		ПО ОтчетКомитентуОПродажах.Номенклатура = СправочникНоменклатура.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК ТаблицаСчетовФактур
|		ПО ОтчетКомитентуОПродажах.ДокументРасчетов = ТаблицаСчетовФактур.ДокументРасчетов
|ГДЕ
|	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
|	И ОтчетКомитентуОПродажах.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ОтчетКомитентуОПродажахТовары.Ссылка,
|	ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации,
|	ОтчетКомитентуОПродажахТовары.Ссылка.Номер,
|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаДокумента,
|	ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
|	ОтчетКомитентуОПродажахТовары.Ссылка.СтавкаНДСВознаграждения,
|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения,
|	ОтчетКомитентуОПродажахТовары.Ссылка.ПодразделениеОрганизации,
|	ОтчетКомитентуОПродажахТовары.НомерСтроки,
|	ВТ_РеквизитыПартий.НомерСтроки,
|	ОтчетКомитентуОПродажахТовары.Номенклатура,
|	ВЫБОР
|		КОГДА НЕ ОтчетКомитентуОПродажахТовары.Содержание ПОДОБНО """"
|			ТОГДА ОтчетКомитентуОПродажахТовары.Содержание
|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
|			ТОГДА СправочникНоменклатура.Наименование
|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
|	КОНЕЦ,
|	ВЫБОР
|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
|			ТОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Артикул
|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
|			ТОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Код
|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
|			ТОГДА """"
|	КОНЕЦ,
|	ОтчетКомитентуОПродажахТовары.КоличествоМест,
|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения.Представление,
|	ОтчетКомитентуОПродажахТовары.Номенклатура.ЕдиницаИзмерения,
|	ОтчетКомитентуОПродажахТовары.Количество,
|	ОтчетКомитентуОПродажахТовары.Цена,
|	ОтчетКомитентуОПродажахТовары.Сумма,
|	ОтчетКомитентуОПродажахТовары.СуммаНДС,
|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
|	ДАТАВРЕМЯ(1, 1, 1),
|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС,
|	ВТ_РеквизитыПартий.Партия,
|	ВТ_РеквизитыПартий.ДатаПартии,
|	ВТ_РеквизитыПартий.ДатаВходящегоСчетаФактуры,
|	ВТ_РеквизитыПартий.НомерВходящегоСчетаФактуры,
|	ВТ_РеквизитыПартий.ДатаВходящегоДокумента,
|	ВТ_РеквизитыПартий.НомерВходящегоДокумента,
|	ВТ_РеквизитыПартий.ДатаВыданногоСчетаФактуры,
|	ВТ_РеквизитыПартий.НомерВыданногоСчетаФактуры,
|	ВТ_РеквизитыПартий.Партия,
|	НЕОПРЕДЕЛЕНО,
|	NULL,
|	NULL,
|	NULL,
|	NULL,
|	NULL,
|	NULL
|ИЗ
|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПартий КАК ВТ_РеквизитыПартий
|		ПО ОтчетКомитентуОПродажахТовары.КлючСтроки = ВТ_РеквизитыПартий.КлючСтроки
|			И ОтчетКомитентуОПродажахТовары.Ссылка = ВТ_РеквизитыПартий.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
|		ПО ОтчетКомитентуОПродажахТовары.Номенклатура = СправочникНоменклатура.Ссылка
|ГДЕ
|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
|
|УПОРЯДОЧИТЬ ПО
|	Дата,
|	НомерСтрокиПоставщики,
|	ПолеДляИтогов,
|	ОтчетКомитентуОПродажах.НомерСтроки,
|	ЭтоВозврат,
|	СчетФактураПокупателю
|ИТОГИ
|	МАКСИМУМ(Ссылка),
|	МАКСИМУМ(ВидОперации),
|	МАКСИМУМ(Номер),
|	МАКСИМУМ(Дата),
|	МАКСИМУМ(Контрагент),
|	МАКСИМУМ(Организация),
|	МАКСИМУМ(ВалютаДокумента),
|	МАКСИМУМ(СуммаВознаграждения),
|	МИНИМУМ(НомерСтрокиПоставщики),
|	СУММА(КоличествоМест),
|	СУММА(Количество),
|	СУММА(Сумма),
|	СУММА(СуммаНДС),
|	МАКСИМУМ(ПокупательПоставщик),
|	МАКСИМУМ(ДатаПартии),
|	МАКСИМУМ(ДатаВходящегоСчетаФактуры),
|	МАКСИМУМ(НомерВходящегоСчетаФактуры),
|	МАКСИМУМ(ДатаВходящегоДокумента),
|	МАКСИМУМ(НомерВходящегоДокумента),
|	МАКСИМУМ(ДатаВыданногоСчетаФактуры),
|	МАКСИМУМ(НомерВыданногоСчетаФактуры),
|	МАКСИМУМ(НомерСФКомиссионера),
|	МАКСИМУМ(ДатаСФКомиссионера),
|	МАКСИМУМ(ЭтоВозврат)
|ПО
|	Ссылка,
|	ВидСобытия,
|	ПолеДляИтогов,
|	СчетФактураПокупателю";	

ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");

Итого = 0;
НомерПП = 1;

ПервыйДокумент = Истина;

ОтчетНапечатан = Ложь;
Пока ВыборкаДокументов.Следующий() Цикл
	
	Если НЕ ПервыйДокумент Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ОтчетНапечатан = Истина;
	ПервыйДокумент = Ложь;
	// Запомним номер строки, с которой начали выводить текущий документ.
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Если ВыборкаДокументов.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОПродажах");
		ЭтоКомиссияПоПродаже = Истина;
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОЗакупках");
		ЭтоКомиссияПоПродаже = Ложь;
	КонецЕсли;
	
	// Выводим шапку накладной
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(ВыборкаДокументов.Ссылка, НСтр("ru = 'Отчет комитенту'"));
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДокументов.Организация, ВыборкаДокументов.Дата);
	ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	
	СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДокументов.Контрагент, ВыборкаДокументов.Дата);
	ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
	ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
	ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Организация");
	ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
	ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьШапки = ?(ВыводитьКоды, "ШапкаСКодом", "ШапкаТаблицы");
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ОбластьМакета.Параметры.ИмяКодАртикул = "Артикул";
	ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ОбластьМакета.Параметры.ИмяКодАртикул = "Код";
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Итого = 0;
	НомерПП = 1;
	ОбластьСтроки = ?(ВыводитьКоды,	"СтрокаСКодом", "Строка");
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
	
	КоличествоТоваров = 0;

	ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;
	
	Если ПечататьСВидомСобытия Тогда
	
		ОбластьМакетаСобытия = Макет.ПолучитьОбласть("ВидСобытия");
		
	Иначе
	
		ОбластьМакетаСобытия = Неопределено;
		
	КонецЕсли;
	
	ВыборкаПоВидуСобытия = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидСобытия");
	Пока ВыборкаПоВидуСобытия.Следующий() Цикл
		
		Если ПечататьСВидомСобытия Тогда
			// Выводит вид события
			ОбластьМакетаСобытия.Параметры.ПредставлениеСобытия = ВыборкаПоВидуСобытия.ВидСобытия;
			ТабличныйДокумент.Вывести(ОбластьМакетаСобытия);
		КонецЕсли;
	
		ВыборкаКонтрагентов = ВыборкаПоВидуСобытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКонтрагентов.Следующий() Цикл
			
			СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаКонтрагентов.ПокупательПоставщик, ВыборкаДокументов.Дата);
			Если ЭтоКомиссияПоПродаже Тогда
				ТекстКонтрагент = НСтр("ru = 'Покупатель: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
			Иначе
				ТекстКонтрагент = НСтр("ru = 'Поставщик: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
			КонецЕсли;
			ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' Адрес: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ЮридическийАдрес,");
			КПП = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "КПП,", Ложь);
			Если ЗначениеЗаполнено(КПП) Тогда
				КПП = "/" + КПП;
			КонецЕсли;
			Если ЭтоКомиссияПоПродаже Тогда
				ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП покупателя: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь) + КПП;
			Иначе
				ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП поставщика: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь) + КПП;
			КонецЕсли;
			
			// Сформируем информацию о реквизитах партии поставки.
			Если НЕ ЭтоКомиссияПоПродаже Тогда
				ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
				
				Если ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоДокумента)
					И ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоДокумента) Тогда
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоДокумента 
					+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоДокумента, "ДЛФ=Д");
				Иначе
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + Формат(ВыборкаКонтрагентов.ДатаПартии, "ДЛФ=Д");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры)
					И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры) Тогда
					ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Получен счет-фактура поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры 
					+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры, "ДЛФ=Д");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры)
					И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры) Тогда
					
					ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Выдан счет-фактура комитенту: № '") 
					+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры, Истина, Ложь) 
					+ " от " + Формат(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры, "ДЛФ=Д");
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагент");
			ОбластьМакета.Параметры.ПредставлениеКонтрагента = ТекстКонтрагент;
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если ПечататьСВидомСобытия Тогда
				ОбластьМакетаДокументПоПокупателю = Макет.ПолучитьОбласть("ДокументПокупателю");
			КонецЕсли;
			
			ИтогоПоКонтрагенту = 0;

			ВыборкаПоСчетФактуре = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактураПокупателю");
			Пока ВыборкаПоСчетФактуре.Следующий() Цикл
				
				Если ПечататьСВидомСобытия Тогда
	
					ПредставлениеДокумента = ПолучитьПредставлениеДокументаВыданногоПокупателю(ВыборкаПоСчетФактуре);
					
					Если ЗначениеЗаполнено(ПредставлениеДокумента) Тогда 
					
						ОбластьМакетаДокументПоПокупателю.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
						ТабличныйДокумент.Вывести(ОбластьМакетаДокументПоПокупателю);
						
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
				
				ВыборкаТоваров = ВыборкаПоСчетФактуре.Выбрать();
				
				Пока ВыборкаТоваров.Следующий() Цикл
					
					КоличествоТоваров = КоличествоТоваров + 1;
					
					ОбластьМакета.Параметры.Заполнить(ВыборкаТоваров);
					ОбластьМакета.Параметры.НомерСтроки = НомерПП;
					
					Если НЕ ВыборкаТоваров.СуммаВключаетНДС Тогда
						СуммаПоСтроке = ВыборкаТоваров.Сумма + ВыборкаТоваров.СуммаНДС;
						ОбластьМакета.Параметры.Цена = ?(ВыборкаТоваров.Количество <> 0, СуммаПоСтроке/ВыборкаТоваров.Количество, 0);
						ОбластьМакета.Параметры.Сумма = СуммаПоСтроке;
					Иначе
						СуммаПоСтроке = ВыборкаТоваров.Сумма;
					КонецЕсли;			
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Итого = Итого + СуммаПоСтроке;
					НомерПП = НомерПП + 1;
					ИтогоПоКонтрагенту = ИтогоПоКонтрагенту + СуммаПоСтроке;
					
				КонецЦикла;	
				
			КонецЦикла;

			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагентИтог");
			ОбластьМакета.Параметры.Заполнить(ВыборкаКонтрагентов);
			ОбластьМакета.Параметры.Сумма = ИтогоПоКонтрагенту;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;	
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = Итого;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	
	ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, ВыборкаДокументов.ВалютаДокумента);
	
	ОбластьМакета.Параметры.СуммаВознаграждения = НСтр("ru = 'Сумма комиссионного вознаграждения составила'") + " "
	+ ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(ВыборкаДокументов.СуммаВознаграждения, ВыборкаДокументов.ВалютаДокумента);
	
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru = 'Всего наименований %Количество%, на сумму'") + " "
	+ ОбщегоНазначенияБПВызовСервера.ФорматСумм(Итого, ВыборкаДокументов.ВалютаДокумента);
	
	ОбластьМакета.Параметры.ИтоговаяСтрока = СтрЗаменить(ОбластьМакета.Параметры.ИтоговаяСтрока, "%Количество%", КоличествоТоваров);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// В табличном документе зададим имя области, в которую был
	// выведен объект. Нужно для возможности печати покомплектно.
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
	НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	
КонецЦикла;

Если НЕ ОтчетНапечатан Тогда 
	Шаблон = МассивОбъектов[0];
	
	Если Шаблон.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОПродажах");
		ЭтоКомиссияПоПродаже = Истина;
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОЗакупках");
		ЭтоКомиссияПоПродаже = Ложь;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шаблон, НСтр("ru = 'Отчет комитенту'"));
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шаблон.Организация, Шаблон.Дата);
	ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	
	СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шаблон.Контрагент, Шаблон.Дата);
	ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
	ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
	ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Организация");
	ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
	ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;
	
	Если ПечататьСВидомСобытия Тогда
	
		ОбластьМакета = Макет.ПолучитьОбласть("ВидСобытия");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
	ТабличныйДокумент.ВысотаТаблицы + 1, ОбъектыПечати, Шаблон);
КонецЕсли;

Возврат ТабличныйДокумент;

КонецФункции

//  Функция формирует табличиный документ как акт об оказании услуг
// на сумму вознаграждения
//
Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитентуОПродажах_АктОбУслугах";

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Ссылка,
	|	ОтчетКомитентуОПродажах.Номер,
	|	ОтчетКомитентуОПродажах.Дата,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Получатель,
	|	ОтчетКомитентуОПродажах.Организация КАК Поставщик,
	|	ОтчетКомитентуОПродажах.Организация,
	|	ОтчетКомитентуОПродажах.СуммаДокумента,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажах.СуммаВознаграждения КАК Сумма,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК Номенклатура,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК Товар,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ОтчетКомитентуОПродажах.УслугаПоВознаграждению.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ОтчетКомитентуОПродажах.УслугаПоВознаграждению.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ КАК КодАртикул,
	|	ОтчетКомитентуОПродажах.СуммаВключаетНДС,
	|	ЕСТЬNULL(ВТ_Товары.СуммаНДСВознаграждения, 0) КАК СуммаНДСВознаграждения,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.ПериодичностьУслуги КАК ПериодичностьУслуги
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО ОтчетКомитентуОПродажах.Ссылка = ВТ_Товары.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКомитентуОПродажах.Дата,
	|	ОтчетКомитентуОПродажах.Ссылка";

	Шапка = Запрос.Выполнить().Выбрать();

	ПервыйДокумент = Истина;

	Пока Шапка.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ИтогоНДС = Шапка.СуммаНДСВознаграждения;
		СуммаКПрописи =	Шапка.Сумма;

		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_АктОбУслугах");

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);

		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");

		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");

		ДанныеПечатиШапка = Новый Структура;
		ДанныеПечатиШапка.Вставить("ПредставлениеПоставщика", ПредставлениеОрганизации);
		ДанныеПечатиШапка.Вставить("ПредставлениеПолучателя", ПредставлениеКонтрагента);

		ДанныеПечатиШапка.Вставить("ТекстЗаголовка", ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, НСтр("ru = 'Акт об оказании услуг'")));

		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиШапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьСтроки = ?(ВыводитьКоды, "ТаблицаСКодом", "ТаблицаБезКода");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПериодичностьУслуг") Тогда
			ДанныеПечатиНоменклатуры = Новый Структура;
			ДанныеПечатиНоменклатуры.Вставить("Товар", РаботаСНоменклатуройКлиентСервер.СодержаниеУслуги(
				Шапка.Товар, Шапка.ПериодичностьУслуги, Шапка.Дата));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечатиНоменклатуры);
		КонецЕсли;
		ДанныеПечатиКолонкаКодов = Новый Структура;
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			ДанныеПечатиКолонкаКодов.Вставить("ИмяКодАртикул", "Артикул");
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
			ДанныеПечатиКолонкаКодов.Вставить("ИмяКодАртикул", "Код");
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиКолонкаКодов);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Заполнить(Новый Структура("Всего", ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи)));
		ТабличныйДокумент.Вывести(ОбластьМакета);


		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		Если ИтогоНДС <> 0 Тогда
			ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоНДС);
			НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru = 'В том числе НДС'"), НСтр("ru = 'Сумма НДС'"));
		Иначе
			ВсегоНДС = НСтр("ru='-'");
			НДС      = НСтр("ru = 'Без налога (НДС)'");
		КонецЕсли;
		ДанныеПечатиИтогоНДС = Новый Структура;
		ДанныеПечатиИтогоНДС.Вставить("ВсегоНДС", ВсегоНДС);
		ДанныеПечатиИтогоНДС.Вставить("НДС", НДС);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиИтогоНДС);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ТекстИтоговаяСтрока = НСтр("ru = 'Сумма комиссионного вознаграждения составила %1'");
		ИтоговаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИтоговаяСтрока,
			ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента));
		СуммаПрописью  = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		ДанныеПечатиСуммаПрописью = Новый Структура;
		ДанныеПечатиСуммаПрописью.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
		ДанныеПечатиСуммаПрописью.Вставить("СуммаПрописью", СуммаПрописью);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСуммаПрописью);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ПодготовитьТекстЗапросаДляПечатиСправкиРасчетаРублевыеСуммыДокументовВВалюте(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("ВТ_ТаблицаПоШапкеДокумента",                                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаРеквизитов",                                         НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РегистрСведенийРублевыеСуммыДокументовВВалюте",             НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_Вознаграждание",                                         НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ПоДокументамЗачетнныхАвансов",                           НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПредоплат",                                          НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Уничтожение_ВТ_ПоДокументамЗачетнныхАвансов",               НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Уничтожение_ВТ_ТаблицаПоШапкеДокумента",                    НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСумм",                                               НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Уничтожение_РегистрСведенийРублевыеСуммыДокументовВВалюте", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Уничтожение_ВТ_Вознаграждание",                             НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеОбрабатываемогоДокумента.Ссылка КАК Ссылка,
	|	ДанныеОбрабатываемогоДокумента.Дата КАК Дата,
	|	ДанныеОбрабатываемогоДокумента.Проведен КАК Проведен,
	|	ДанныеОбрабатываемогоДокумента.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеОбрабатываемогоДокумента.Организация КАК Организация,
	|	ДанныеОбрабатываемогоДокумента.Контрагент КАК Контрагент,
	|	ДанныеОбрабатываемогоДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеОбрабатываемогоДокумента.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
	|	ДанныеОбрабатываемогоДокумента.СчетУчетаРасчетовПоАвансам КАК СчетУчетаРасчетовПоАвансам,
	|	ДанныеОбрабатываемогоДокумента.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеОбрабатываемогоДокумента.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	"""" КАК НомерВходящегоДокумента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ДанныеОбрабатываемогоДокумента.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДанныеОбрабатываемогоДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеОбрабатываемогоДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеОбрабатываемогоДокумента.СтавкаНДСВознаграждения,
	|	ДанныеОбрабатываемогоДокумента.УслугаПоВознаграждению
	|ПОМЕСТИТЬ ВТ_ТаблицаПоШапкеДокумента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ДанныеОбрабатываемогоДокумента
	|ГДЕ
	|	ДанныеОбрабатываемогоДокумента.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПоШапкеДокумента.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПоШапкеДокумента.Дата КАК Дата,
	|	ВТ_ТаблицаПоШапкеДокумента.Проведен КАК Проведен,
	|	ВТ_ТаблицаПоШапкеДокумента.ВалютаДокумента КАК ВалютаДокумента,
	|	ВТ_ТаблицаПоШапкеДокумента.Организация,
	|	ВТ_ТаблицаПоШапкеДокумента.Контрагент,
	|	ВТ_ТаблицаПоШапкеДокумента.ДоговорКонтрагента,
	|	ВТ_ТаблицаПоШапкеДокумента.КурсВзаиморасчетов,
	|	ВТ_ТаблицаПоШапкеДокумента.КратностьВзаиморасчетов,
	|	ВТ_ТаблицаПоШапкеДокумента.НомерВходящегоДокумента,
	|	ВТ_ТаблицаПоШапкеДокумента.ДатаВходящегоДокумента,
	|	ВТ_ТаблицаПоШапкеДокумента.РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПоШапкеДокумента.УчетАгентскогоНДС,
	|	ВТ_ТаблицаПоШапкеДокумента.СуммаВключаетНДС,
	|	0 КАК ВсегоВал,
	|	0 КАК НДСВал
	|ИЗ
	|	ВТ_ТаблицаПоШапкеДокумента КАК ВТ_ТаблицаПоШапкеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РублевыеСуммыДокументовВВалюте.Регистратор КАК Регистратор,
	|	РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	СУММА(РублевыеСуммыДокументовВВалюте.Всего) КАК Всего,
	|	СУММА(РублевыеСуммыДокументовВВалюте.НДС) КАК НДС,
	|	СУММА(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС) КАК НалоговаяБазаНДС
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаПоШапкеДокумента КАК ВТ_ТаблицаПоШапкеДокумента
	|		ПО РублевыеСуммыДокументовВВалюте.Регистратор = ВТ_ТаблицаПоШапкеДокумента.Ссылка
	|			И (РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	РублевыеСуммыДокументовВВалюте.Регистратор,
	|	РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента,
	|	РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ТабличнаяЧастьДокумента,
	|	НомерСтрокиДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|	1 КАК НомерСтроки,
	|	ВТ_ТаблицаПоШапкеДокумента.УслугаПоВознаграждению КАК Товар,
	|	ВТ_ТаблицаПоШапкеДокумента.УслугаПоВознаграждению.Наименование КАК ТоварНаименование,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК ВсегоВал,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК НДСВал,
	|	ВТ_ТаблицаПоШапкеДокумента.СтавкаНДСВознаграждения КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_Вознаграждение
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаПоШапкеДокумента КАК ВТ_ТаблицаПоШапкеДокумента
	|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ВТ_ТаблицаПоШапкеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.Ссылка,
	|	ВТ_ТаблицаПоШапкеДокумента.УслугаПоВознаграждению,
	|	ВТ_ТаблицаПоШапкеДокумента.УслугаПоВознаграждению.Наименование,
	|	ВТ_ТаблицаПоШапкеДокумента.СтавкаНДСВознаграждения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Регистратор КАК Ссылка,
	|	Хозрасчетный.Сумма КАК СуммаПредоплатыРуб,
	|	Хозрасчетный.ВалютнаяСуммаДт КАК СуммаПредоплатыВал,
	|	ХозрасчетныйСубконто.Значение КАК Документ,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйСубконто.Значение) КАК ДокументПредоплатыПредставление,
	|	ВТ_ТаблицаПоШапкеДокумента.Организация КАК Организация
	|ПОМЕСТИТЬ ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаПоШапкеДокумента КАК ВТ_ТаблицаПоШапкеДокумента
	|		ПО Хозрасчетный.Регистратор = ВТ_ТаблицаПоШапкеДокумента.Ссылка
	|			И Хозрасчетный.СчетДт = ВТ_ТаблицаПоШапкеДокумента.СчетУчетаРасчетовПоАвансам
	|			И Хозрасчетный.СчетКт = ВТ_ТаблицаПоШапкеДокумента.СчетУчетаРасчетовСКонтрагентом
	|			И (ВТ_ТаблицаПоШапкеДокумента.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
	|		ПО Хозрасчетный.Регистратор = ХозрасчетныйСубконто.Регистратор
	|			И Хозрасчетный.НомерСтроки = ХозрасчетныйСубконто.НомерСтроки
	|			И (ХозрасчетныйСубконто.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет))
	|			И (ХозрасчетныйСубконто.Вид = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.Ссылка КАК Ссылка,
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.СуммаПредоплатыРуб КАК СуммаПредоплатыРуб,
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.СуммаПредоплатыВал КАК СуммаПредоплатыВал,
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.Документ,
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.ДокументПредоплатыПредставление,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, """") КАК НомерВходящегоДокумента,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВходящегоДокумента
	|ИЗ
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента КАК ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.Организация = ДанныеПервичныхДокументов.Организация
	|			И ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.Документ = ДанныеПервичныхДокументов.Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента.Ссылка
	|ИТОГИ
	|	СУММА(СуммаПредоплатыРуб),
	|	СУММА(СуммаПредоплатыВал)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоДокументамЗачетнныхАвансовДоПолученияНомераИДатыВходящегоДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТаблицаПоШапкеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вознаграждение.Ссылка КАК Ссылка,
	|	ВТ_Вознаграждение.НомерСтроки,
	|	ВТ_Вознаграждение.Товар,
	|	ВТ_Вознаграждение.ТоварНаименование,
	|	ВТ_Вознаграждение.ВсегоВал КАК ВсегоВал,
	|	ВТ_Вознаграждение.НДСВал КАК НДСВал,
	|	ВТ_Вознаграждение.СтавкаНДС,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего КАК ВсегоРуб,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС КАК НДСРуб,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДСРуб
	|ИЗ
	|	ВТ_Вознаграждение КАК ВТ_Вознаграждение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО ВТ_Вознаграждение.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
	|			И ВТ_Вознаграждение.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|ГДЕ
	|	ВТ_Вознаграждение.ВсегоВал <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Вознаграждение.Ссылка,
	|	ВТ_Вознаграждение.НомерСтроки
	|ИТОГИ
	|	СУММА(ВсегоВал),
	|	СУММА(НДСВал),
	|	СУММА(ВсегоРуб),
	|	СУММА(НДСРуб),
	|	СУММА(НалоговаяБазаНДСРуб)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Вознаграждение";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Контрагент");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредставлениеДокументаВыданногоПокупателю(ВыборкаПоСчетФактуре)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоСчетФактуре.СчетФактураПокупателю) Тогда
		Возврат Неопределено;
	КонецЕсли;

// Формирует текст по какому счету-фактуре выдавался товар
	ЭтоВозврат = ВыборкаПоСчетФактуре.ЭтоВозврат;
	
	Если ЭтоВозврат Тогда
		
		КСчетамФактурам = ОписаниеИсправляемыхДокументов(ЭтоВозврат, ВыборкаПоСчетФактуре.СчетФактураПокупателю);
		
		ПредставлениеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выдан покупателю корректировочный счет-фактура № %1 от %2 к счетам-фактурам:%3'"), 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоСчетФактуре.НомерСФКомиссионера, Истина, Ложь),
		Формат(ВыборкаПоСчетФактуре.ДатаСФКомиссионера, "ДФ=dd.MM.yyyy"), КСчетамФактурам);
		
	Иначе

		ПредставлениеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выдан покупателю счет-фактура № %1 от %2'"), 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоСчетФактуре.НомерСФКомиссионера, Истина, Ложь),
		Формат(ВыборкаПоСчетФактуре.ДатаСФКомиссионера, "ДФ=dd.MM.yyyy"));
	
	КонецЕсли;

	Возврат ПредставлениеДокумента;
	
КонецФункции

Функция ОписаниеИсправляемыхДокументов(ЭтоВозврат, СчетФактураПокупателю)
	
	Если НЕ ЭтоВозврат ИЛИ НЕ ЗначениеЗаполнено(СчетФактураПокупателю) Тогда
		Возврат "";
	КонецЕсли;

	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СчетФактураПокупателю, "ДокументыОснования");

	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ВыборкаСтрок = Результат.Выбрать();
	ОписаниеИсправляемыхСчетовФактур = "";
	Индекс = 0;
	КоличествоСтрок = ВыборкаСтрок.Количество();
	
	Пока ВыборкаСтрок.Следующий() Цикл

		Индекс = Индекс + 1;
		ЭтоПоследнийВыводимыйДокумент = (Индекс = КоличествоСтрок);
	
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрок.ИсходныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыИсправляемыйДокумента = ПараметрыИсходногоДокумента(ВыборкаСтрок.ИсходныйДокумент);
		
		ОписаниеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='№ %1 от %2%3 '"),
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыИсправляемыйДокумента.Номер, Истина, Ложь),
			Формат(ПараметрыИсправляемыйДокумента.Дата, "ДФ=dd.MM.yyyy"), ?(ЭтоПоследнийВыводимыйДокумент, "", ", "));
		
		ОписаниеИсправляемыхСчетовФактур = ОписаниеИсправляемыхСчетовФактур + ОписаниеДокумента;
		
	КонецЦикла;
	
	Возврат ОписаниеИсправляемыхСчетовФактур;
	
КонецФункции

Функция ПараметрыИсходногоДокумента(ИсходныйДокумент)

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходныйДокумент, "Номер, Дата");

КонецФункции

#КонецЕсли