
//Описание и порядок формирования документа «Калькуляция»

//Название документа («шапка») – единое для всех документов
//Поле «№» - номер документа в 1С
//Поле «Дата» - дата документа в 1С
//Поле «Заказчик» - выбирается пользователем из справочника «Контрагенты»
//Поле «Заказчик» - выбирается пользователем из справочника «Контрагенты»
//Поле «Перевозчик» - вносится пользователем вручную, формат текстовой,
 //макс. кол-во знаков неограниченно

//Поле «Рег. номер ВС» - вносится пользователем вручную, формат текстовой, макс. кол-во знаков 12, только заглавные буквы
//Поле «Тип ВС» - вносится пользователем вручную, формат текстовой, макс. кол-во знаков 7, только заглавные буквы
//Поле «МВМ ВС» - вносится пользователем вручную, формат числовой с разделителем разрядов (пробел), макс. кол-во знаков 7
//Поле «Маршрут» - вносится пользователем вручную, формат текстовой, макс. кол-во знаков неограниченно
//Поля «Дата прилета», «Дата вылета», - вносится пользователем вручную, формат даты (ДД, ММ, ГГГГ)
//Поле «Валюта»  - выбирается пользователем из справочника «Валюты».

//Табличная часть
//Раздел «Собственные услуги» формируется пользователем из документа «Реализация услуг:Акт»: 
//пользователь выбирает «Акт» из списка, далее: либо в данный раздел табличной части 
//подгружаются все строки (услуги) из табличной части «Акта» и пользователь при 
//необходимости может удалить лишние строки, либо пользователь выбирает нужные строки (услуги) 
//из «Акта» и подгружаются только выбранные. В столбцы подгружаются данные 
//из соответствующих столбцов табличной части «Акта».

//Добавление данных в раздел должно быть возможно из нескольких документов «Реализация услуг: Акт».
//Промежуточный результат по разделу суммируется по столбцам «Сумма», «НДС», «Всего».

//Раздел «Аентские услуги» формируется из документов «Отчет коммитенту (Отчет о закупках)» 
//аналогичным способом, данные берутся из табличной части «Товары и услуги» (закладка «Товары и услуги»).

//При этом комиссионное вознаграждение (закладка «Главное») должно подгружаться в раздел «Собственные услуги».

//Также как и с собственными услугами должна быть возможность формировать табличную часть из нескольких
 //«Отчетов комитенту (Отчетов о закупках).
//Общая сумма – сумма значений двух разделов.

//Поле «Исполнитель» - текущий пользователь 1С.




&НаКлиенте
Процедура СформироватьДокумент(Команда)
	ОткрытьФорму("Документ.Калькуляция.Форма.ФормаДокумента");
	//СформироватьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументНаСервере()

КонецПроцедуры


&НаКлиенте
Процедура ДокументыПоступлениеТоваровУслугПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОтчетКомитентуПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры


&НаСервере
Процедура ДокументыРеализацияТоваровУслугВыборНаСервере()
sd ="";
КонецПроцедуры


&НаКлиенте
Процедура ДокументыРеализацияТоваровУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДокументыРеализацияТоваровУслугВыборНаСервере();
КонецПроцедуры

//1
&НаКлиенте
Процедура ДокументыРеализацияТоваровУслугПриАктивизацииСтроки(Элемент)
	df = "";
КонецПроцедуры


&НаКлиенте
Процедура ДокументыРеализацияТоваровУслугВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	sd = "";
КонецПроцедуры

