
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если Элементы.СписокОтчетовКомитента.ВыделенныеСтроки.Количество() = 0 Или 
					Элементы.СписокТоваровИУслуг.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;

	СтруктураДанных = Новый Структура();	
	МассивДанных = Новый Массив();	
		Для Каждого ВыделеннаяСтрока Из Элементы.СписокТоваровИУслуг.ВыделенныеСтроки Цикл
			СтрокиДанныхПоУслуге = ЭтаФорма.Элементы.СписокТоваровИУслуг.ДанныеСтроки(ВыделеннаяСтрока);
			СтруктураВыбраннойСтроки = Новый Структура;
				СтруктураВыбраннойСтроки.Вставить("Всего", СтрокиДанныхПоУслуге.Всего);
				СтруктураВыбраннойСтроки.Вставить("Количество", СтрокиДанныхПоУслуге.Количество);
				СтруктураВыбраннойСтроки.Вставить("Номенклатура", СтрокиДанныхПоУслуге.Номенклатура);
				СтруктураВыбраннойСтроки.Вставить("Содержание", СтрокиДанныхПоУслуге.Содержание);
				СтруктураВыбраннойСтроки.Вставить("СтавкаНДС", СтрокиДанныхПоУслуге.СтавкаНДС);
				СтруктураВыбраннойСтроки.Вставить("Сумма", СтрокиДанныхПоУслуге.Сумма);
				СтруктураВыбраннойСтроки.Вставить("СуммаНДС", СтрокиДанныхПоУслуге.СуммаНДС);
				СтруктураВыбраннойСтроки.Вставить("Цена", СтрокиДанныхПоУслуге.Цена);
				СтруктураВыбраннойСтроки.Вставить("КоличествоМест", СтрокиДанныхПоУслуге.КоличествоМест);
				СтруктураВыбраннойСтроки.Вставить("ЕдиницаИзмерения", СтрокиДанныхПоУслуге.ЕдиницаИзмерения);
				СтруктураВыбраннойСтроки.Вставить("Коэффициент", СтрокиДанныхПоУслуге.Коэффициент);
				СтруктураВыбраннойСтроки.Вставить("СуммаВознаграждения", СтрокиДанныхПоУслуге.СуммаВознаграждения);
				СтруктураВыбраннойСтроки.Вставить("СуммаНДСВознаграждения", СтрокиДанныхПоУслуге.СуммаНДСВознаграждения);
				СтруктураВыбраннойСтроки.Вставить("Код", СтрокиДанныхПоУслуге.Код);
				СтруктураВыбраннойСтроки.Вставить("Артикул", СтрокиДанныхПоУслуге.Артикул);
				СтруктураВыбраннойСтроки.Вставить("ВсегоВознаграждение", СтрокиДанныхПоУслуге.ВсегоВознаграждение);
			МассивДанных.Добавить(СтруктураВыбраннойСтроки);
		КонецЦикла;
			СтруктураДанных.Вставить("ДокументОтчетаКомитента", ПолучениеДанныхПоВознаграждения());
			СтруктураДанных.Вставить("ВыбранныеТоварыИУслуги", МассивДанных);

	Если МассивДанных.Количество() > 0 Тогда 
		Оповестить("ПолучитьСписокУслугПоОтчетуКомитента", СтруктураДанных);
	КонецЕсли;

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеСтроки(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДанФорму(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделениеСтрок(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовКомитентаПриАктивизацииСтроки(Элемент)
	ЗаполнитьТЧСпискаНоменклатуры(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧСпискаНоменклатуры(ВыбранныйДокумент)

		СписокТоваровИУслуг.Очистить();

		Если ВыбранныйДокумент <> Неопределено Тогда 
			Если ВыбранныйДокумент.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда 
				ВыбранныйДокументКомитента = ВыбранныйДокумент;
			Иначе 
				Возврат;
			КонецЕсли;
		КонецЕсли;

	 НомерСтроки = 1;
		Для Каждого СтрокаУслугДокумента Из ВыбранныйДокумент.Товары Цикл 
			НоваяСтрокаСписка = СписокТоваровИУслуг.Добавить();
			НоваяСтрокаСписка.НомерСтроки = НомерСтроки;
			НоваяСтрокаСписка.Номенклатура = СтрокаУслугДокумента.Номенклатура;
			НоваяСтрокаСписка.Содержание = СтрокаУслугДокумента.Содержание;
			НоваяСтрокаСписка.Код = СтрокаУслугДокумента.Номенклатура.Код;
			НоваяСтрокаСписка.Артикул = СтрокаУслугДокумента.Номенклатура.Артикул;
			НоваяСтрокаСписка.Количество = СтрокаУслугДокумента.Количество;
			НоваяСтрокаСписка.Цена = СтрокаУслугДокумента.Цена;
			НоваяСтрокаСписка.Сумма = СтрокаУслугДокумента.Сумма;
			НоваяСтрокаСписка.СтавкаНДС = СтрокаУслугДокумента.СтавкаНДС;
			НоваяСтрокаСписка.СуммаНДС = СтрокаУслугДокумента.СуммаНДС;
			НоваяСтрокаСписка.ЕдиницаИзмерения = СтрокаУслугДокумента.ЕдиницаИзмерения;
			НоваяСтрокаСписка.Коэффициент = СтрокаУслугДокумента.Коэффициент;
			НоваяСтрокаСписка.КоличествоМест =  СтрокаУслугДокумента.КоличествоМест;


			НоваяСтрокаСписка.СуммаНДСВознаграждения = 0;
			НоваяСтрокаСписка.ВсегоВознаграждение = 0;
		НомерСтроки = НомерСтроки + 1;		
		КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучениеДанныхПоВознаграждения()

	МассивПоВознаграждениям = Новый Массив();
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.СпособРасчетаКомиссионногоВознаграждения);
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.ПроцентКомиссионногоВознаграждения);
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.СчетУчетаНДСПоРеализации);
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.СтавкаНДСВознаграждения);
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.УслугаПоВознаграждению);
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.СчетДоходов);
		МассивПоВознаграждениям.Добавить(ВыбранныйДокументКомитента.Субконто);

	Возврат МассивПоВознаграждениям;

КонецФункции

